Smart-Display-Series/STM32F750_InitialCode/Bootloader/Core/Inc/qspi.h
/**
 ******************************************************************************
 * @file    stm32f7508_discovery_qspi.h
 * @author  MCD Application Team
 * @brief   This file contains the common defines and functions prototypes for
 *          the stm32f7508_discovery_qspi.c driver.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/** @addtogroup BSP
 * @{
 */

/** @addtogroup STM32F7508_DISCOVERY
 * @{
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F7508_DISCOVERY_QSPI_H
#define __STM32F7508_DISCOVERY_QSPI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"
#include "n25q128a.h"

/** @addtogroup STM32F7508_DISCOVERY_QSPI
 * @{
 */

/* Exported constants --------------------------------------------------------*/
/** @defgroup STM32F7508_DISCOVERY_QSPI_Exported_Constants STM32F7508_DISCOVERY_QSPI Exported Constants
 * @{
 */
/* QSPI Error codes */
#define QSPI_OK            ((uint8_t)0x00)
#define QSPI_ERROR         ((uint8_t)0x01)
#define QSPI_BUSY          ((uint8_t)0x02)
#define QSPI_NOT_SUPPORTED ((uint8_t)0x04)
#define QSPI_SUSPENDED     ((uint8_t)0x08)

/* Definition for QSPI clock resources */
#define QSPI_CLK_ENABLE()          __HAL_RCC_QSPI_CLK_ENABLE()
#define QSPI_CLK_DISABLE()         __HAL_RCC_QSPI_CLK_DISABLE()
#define QSPI_CS_GPIO_CLK_ENABLE()  __HAL_RCC_GPIOB_CLK_ENABLE()
#define QSPI_CLK_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define QSPI_D0_GPIO_CLK_ENABLE()  __HAL_RCC_GPIOD_CLK_ENABLE()
#define QSPI_D1_GPIO_CLK_ENABLE()  __HAL_RCC_GPIOD_CLK_ENABLE()
#define QSPI_D2_GPIO_CLK_ENABLE()  __HAL_RCC_GPIOE_CLK_ENABLE()
#define QSPI_D3_GPIO_CLK_ENABLE()  __HAL_RCC_GPIOD_CLK_ENABLE()

#define QSPI_FORCE_RESET()         __HAL_RCC_QSPI_FORCE_RESET()
#define QSPI_RELEASE_RESET()       __HAL_RCC_QSPI_RELEASE_RESET()

/* Definition for QSPI Pins */
#define QSPI_CS_PIN                GPIO_PIN_6
#define QSPI_CS_GPIO_PORT          GPIOB
#define QSPI_CLK_PIN               GPIO_PIN_2
#define QSPI_CLK_GPIO_PORT         GPIOB
#define QSPI_D0_PIN                GPIO_PIN_11
#define QSPI_D0_GPIO_PORT          GPIOD
#define QSPI_D1_PIN                GPIO_PIN_12
#define QSPI_D1_GPIO_PORT          GPIOD
#define QSPI_D2_PIN                GPIO_PIN_2
#define QSPI_D2_GPIO_PORT          GPIOE
#define QSPI_D3_PIN                GPIO_PIN_13
#define QSPI_D3_GPIO_PORT          GPIOD

/* N25Q128A13EF840E Micron memory */
/* Size of the flash */
#define QSPI_FLASH_SIZE            23     /* Address bus width to access whole memory space */
#define QSPI_PAGE_SIZE             256

/* This alias is added as the name of Memory mapped fucntion changed */
#define BSP_QSPI_MemoryMappedMode  BSP_QSPI_EnableMemoryMappedMode
/**
 * @}
 */

/* Exported types ------------------------------------------------------------*/
/** @defgroup STM32F7508_DISCOVERY_QSPI_Exported_Types STM32F7508_DISCOVERY_QSPI Exported Types
 * @{
 */
/* QSPI Info */
typedef struct {
	uint32_t FlashSize; /*!< Size of the flash */
	uint32_t EraseSectorSize; /*!< Size of sectors for the erase operation */
	uint32_t EraseSectorsNumber; /*!< Number of sectors for the erase operation */
	uint32_t ProgPageSize; /*!< Size of pages for the program operation */
	uint32_t ProgPagesNumber; /*!< Number of pages for the program operation */
} QSPI_Info;

/**
 * @}
 */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup STM32F7508_DISCOVERY_QSPI_Exported_Functions
 * @{
 */
uint8_t BSP_QSPI_Init(QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_DeInit(QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_Read(uint8_t *pData, uint32_t ReadAddr, uint32_t Size,QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_Write(uint8_t *pData, uint32_t WriteAddr, uint32_t Size,QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_Erase_Block(uint32_t BlockAddress,QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_Erase_Chip(QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_Erase_Sector( uint32_t SectorAddress );
uint32_t qspi_erase(uint32_t memory, QSPI_HandleTypeDef *hqspi);
uint8_t BSP_QSPI_GetStatus(QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_GetInfo(QSPI_Info *pInfo);
uint8_t BSP_QSPI_EnableMemoryMappedMode(QSPI_HandleTypeDef *QSPIHandle);
uint8_t BSP_QSPI_Read_ID( uint8_t *buf );
uint8_t BSP_QSPI_Enter4ByteMode( void );
uint8_t BSP_QSPI_EnterQPIMode( void );
uint8_t BSP_QSPI_ExitQPIMode( void );
uint8_t BSP_QSPI_Read_Config( uint8_t *config );
uint8_t BSP_QSPI_Reset( void );

/* These functions can be modified in case the current settings
 need to be changed for specific application needs */
void BSP_QSPI_MspInit(QSPI_HandleTypeDef *hqspi, void *Params);
void BSP_QSPI_MspDeInit(QSPI_HandleTypeDef *hqspi, void *Params);

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F7508_DISCOVERY_QSPI_H */
/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
